ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0g352x/COMP2_1.0.xml
        </group>
    <group id="COMP2_GEN_EVENT" name="COMP2_GEN_EVENT" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="COMP2_GEN_EVENT_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="1" end="0" width="2" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No pending interrupt"/>
                <bitenum id="COMPIFG" value="0x2" description="Comparator output interrupt"/>
                <bitenum id="COMPINVIFG" value="0x3" description="Comparator output inverted interrupt"/>
                <bitenum id="OUTRDYIFG" value="0x4" description="Comparator output ready interrupt"/>
            </bitfield>
        </register>
        <register id="COMP2_GEN_EVENT_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="COMPIFG" description="Masks COMPIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Masks COMPINVIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Masks OUTRDYIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is masked out"/>
                <bitenum id="SET" value="0x1" description="Interrupt will request an interrupt service routine and corresponding bit in MIS will be set"/>
            </bitfield>
        </register>
        <register id="COMP2_GEN_EVENT_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="COMPIFG" description="Raw interrupt status for comparator output interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Raw interrupt status for comparator output inverted interrupt flag. The IES bit defines the transition of the comparator output setting this bit." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Raw interrupt status for comparator output ready interrupt flag. This bit is set when the comparator output is valid." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No interrupt pending"/>
                <bitenum id="SET" value="0x1" description="Interrupt pending"/>
            </bitfield>
        </register>
        <register id="COMP2_GEN_EVENT_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="COMPIFG" description="Masked interrupt status for COMPIFG" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Masked interrupt status for COMPINVIFG" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="COMPINVIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="COMPINVIFG requests an interrupt service routine"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Masked interrupt status for OUTRDYIFG" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="OUTRDYIFG does not request an interrupt service routine"/>
                <bitenum id="SET" value="0x1" description="OUTRDYIFG requests an interrupt service routine"/>
            </bitfield>
        </register>
        <register id="COMP2_GEN_EVENT_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="COMPIFG" description="Sets COMPIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPIFG is set"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Sets COMPINVIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to COMPINVIFG is set"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Sets OUTRDYIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="RIS bit corresponding to OUTRDYIFG is set"/>
            </bitfield>
        </register>
        <register id="COMP2_GEN_EVENT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="COMPIFG" description="Clears COMPIFG in RIS register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to COMPIFG is cleared"/>
            </bitfield>
            <bitfield id="COMPINVIFG" description="Clears COMPINVIFG in RIS register" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to COMPINVIFG is cleared"/>
            </bitfield>
            <bitfield id="OUTRDYIFG" description="Clears OUTRDYIFG in RIS register" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing a 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="RIS bit corresponding to OUTRDYIFG is cleared"/>
            </bitfield>
        </register>
