ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0g352x/COMP2_1.0.xml
        </group>
    <register id="COMP2_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="COMP2_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="COMP2_CTL0" width="32" offset="0x1100" description="Control 0">
        <bitfield id="IPSEL" description="Channel input selected for the positive terminal of the comparator if IPEN is set to 1." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="CH_0" value="0x0" description="Channel 0 selected"/>
            <bitenum id="CH_1" value="0x1" description="Channel 1 selected"/>
            <bitenum id="CH_2" value="0x2" description="Channel 2 selected"/>
            <bitenum id="CH_3" value="0x3" description="Channel 3 selected"/>
            <bitenum id="CH_4" value="0x4" description="Channel 4 selected"/>
            <bitenum id="CH_5" value="0x5" description="Channel 5 selected"/>
            <bitenum id="CH_6" value="0x6" description="Channel 6 selected"/>
            <bitenum id="CH_7" value="0x7" description="Channel 7  selected"/>
        </bitfield>
        <bitfield id="IPEN" description="Channel input enable for the positive terminal of the comparator." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Selected analog input channel for positive terminal is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Selected analog input channel for positive terminal is enabled"/>
        </bitfield>
        <bitfield id="IMEN" description="Channel input enable for the negative terminal of the comparator." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Selected analog input channel for negative terminal is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Selected analog input channel for negative terminal is enabled"/>
        </bitfield>
        <bitfield id="IMSEL" description="Channel input selected for the negative terminal of the comparator if IMEN is set to 1." begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="CH_0" value="0x0" description="Channel 0 selected"/>
            <bitenum id="CH_1" value="0x1" description="Channel 1 selected"/>
            <bitenum id="CH_2" value="0x2" description="Channel 2 selected"/>
            <bitenum id="CH_3" value="0x3" description="Channel 3 selected"/>
            <bitenum id="CH_4" value="0x4" description="Channel 4 selected"/>
            <bitenum id="CH_5" value="0x5" description="Channel 5 selected"/>
            <bitenum id="CH_6" value="0x6" description="Channel 6 selected"/>
            <bitenum id="CH_7" value="0x7" description="Channel 7 selected"/>
        </bitfield>
    </register>
    <register id="COMP2_CTL1" width="32" offset="0x1104" description="Control 1">
        <bitfield id="ENABLE" description="This bit turns on the comparator. When the comparator is turned off it consumes no power." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Comparator is off"/>
            <bitenum id="ON" value="0x1" description="Comparator is on"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the comparator operating mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FAST" value="0x0" description="Comparator is in fast mode"/>
            <bitenum id="ULP" value="0x1" description="Comparator is in ultra-low power mode"/>
        </bitfield>
        <bitfield id="EXCH" description="This bit exchanges the comparator inputs and inverts the comparator output." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EXC" value="0x0" description="Comparator inputs not exchanged and output not inverted"/>
            <bitenum id="EXC" value="0x1" description="Comparator inputs exchanged and output inverted"/>
        </bitfield>
        <bitfield id="SHORT" description="This bit shorts the positive and negative input terminals of the comparator." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_SHT" value="0x0" description="Comparator positive and negative input terminals are not shorted"/>
            <bitenum id="SHT" value="0x1" description="Comparator positive and negative input terminals are shorted"/>
        </bitfield>
        <bitfield id="IES" description="This bit selected the interrupt edge for COMPIFG and COMPINVIFG." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="RISING" value="0x0" description="Rising edge sets COMPIFG and falling edge sets COMPINVIFG"/>
            <bitenum id="FALLING" value="0x1" description="Falling edge sets COMPIFG and rising edge sets COMPINVIFG"/>
        </bitfield>
        <bitfield id="HYST" description="These bits select the hysteresis setting of the comparator." begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="NO_HYS" value="0x0" description="No hysteresis"/>
            <bitenum id="LOW_HYS" value="0x1" description="Low hysteresis, typical 10mV"/>
            <bitenum id="MED_HYS" value="0x2" description="Medium hysteresis, typical 20mV"/>
            <bitenum id="HIGH_HYS" value="0x3" description="High hysteresis, typical 30mV"/>
        </bitfield>
        <bitfield id="OUTPOL" description="This bit selects the comparator output polarity." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NON_INV" value="0x0" description="Comparator output is non-inverted"/>
            <bitenum id="INV" value="0x1" description="Comparator output is inverted"/>
        </bitfield>
        <bitfield id="FLTEN" description="This bit enables the analog filter at comparator output." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator output filter is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator output filter is enabled"/>
        </bitfield>
        <bitfield id="FLTDLY" description="These bits select the comparator output filter delay. See the device-specific data sheet for specific values on comparator propagation delay for different filter delay settings." begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="DLY_0" value="0x0" description="Typical filter delay of 70 ns"/>
            <bitenum id="DLY_1" value="0x1" description="Typical filter delay of 500 ns"/>
            <bitenum id="DLY_2" value="0x2" description="Typical filter delay of 1200 ns"/>
            <bitenum id="DLY_3" value="0x3" description="Typical filter delay of 2700 ns"/>
        </bitfield>
        <bitfield id="WINCOMPEN" description="This bit enables window comparator operation of comparator." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="window comparator is disable"/>
            <bitenum id="ON" value="0x1" description="window comparator is enable"/>
        </bitfield>
    </register>
